--------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /homes/nber/kimcwa/Documents/E-cigarettes/JUUL/PATH_ANALYSIS/ecigs.
> log
  log type:  text
 opened on:  10 Oct 2020, 21:10:51

. tab use_bc_ppl_imprt_to_me_use wave

use_bc_ppl |
_imprt_to_ |         wave
    me_use |         1          2 |     Total
-----------+----------------------+----------
    -97777 |         1          0 |         1 
        -8 |         2          3 |         5 
         1 |       205        208 |       413 
         2 |       211        204 |       415 
-----------+----------------------+----------
     Total |       419        415 |       834 

. tab use_bc_ilike_socializing_w_ecgs wave

use_bc_ili |
ke_sociali |
zing_w_eci |         wave
        gs |         1          2 |     Total
-----------+----------------------+----------
    -97777 |         1          0 |         1 
        -8 |         1          3 |         4 
        -7 |         1          3 |         4 
         1 |       144        143 |       287 
         2 |       272        266 |       538 
-----------+----------------------+----------
     Total |       419        415 |       834 

. tab use_bc_advert_appealing wave

use_bc_adv |
ert_appeal |         wave
       ing |         1          2 |     Total
-----------+----------------------+----------
    -97777 |         1          0 |         1 
        -8 |         1          2 |         3 
         1 |       165        193 |       358 
         2 |       252        220 |       472 
-----------+----------------------+----------
     Total |       419        415 |       834 

. tab use_bc_media_public_fig_use wave

use_bc_med |
ia_public_ |         wave
   fig_use |         1          2 |     Total
-----------+----------------------+----------
    -97777 |         1          0 |         1 
        -8 |         1          2 |         3 
        -7 |         1          2 |         3 
         1 |        86         60 |       146 
         2 |       330        351 |       681 
-----------+----------------------+----------
     Total |       419        415 |       834 

. tab use_bc_affordable wave 

use_bc_aff |                    wave
   ordable |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
    -97777 |         1          0          0          0 |         1 
        -8 |         1          5          6         12 |        24 
        -7 |         0          0          1          0 |         1 
         1 |       157        150        193        214 |       714 
         2 |       260        260        240        372 |     1,132 
-----------+--------------------------------------------+----------
     Total |       419        415        440        598 |     1,872 

. tab use_bc_use_when_smoking_nt_llwd

use_bc_use_ |
when_smokin |
g_not_allow |
         ed |      Freq.     Percent        Cum.
------------+-----------------------------------
     -97777 |          1        0.05        0.05
         -8 |         16        0.85        0.91
         -7 |          3        0.16        1.07
          1 |        915       48.88       49.95
          2 |        937       50.05      100.00
------------+-----------------------------------
      Total |      1,872      100.00

. tab use_bc_less_harmful_t_m_thn_cgs

use_bc_less |
_harmful_to |
_me_than_ci |
         gs |      Freq.     Percent        Cum.
------------+-----------------------------------
     -97777 |          1        0.05        0.05
         -8 |         16        0.85        0.91
         -7 |          3        0.16        1.07
          1 |      1,311       70.03       71.10
          2 |        541       28.90      100.00
------------+-----------------------------------
      Total |      1,872      100.00

. tab us_bc_lss_hrmfl_t_ppl_rnd_m_th_ wave

use_bc_les |
s_harmful_ |
to_people_ |
around_me_ |                    wave
 than_cigs |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
    -97777 |         1          0          0          0 |         1 
        -8 |         1          2          3          6 |        12 
        -7 |         1          1          2          2 |         6 
         1 |       324        307        285        385 |     1,301 
         2 |        92        105        150        205 |       552 
-----------+--------------------------------------------+----------
     Total |       419        415        440        598 |     1,872 

. tab use_bc_comesin_flavors_ilike wave

use_bc_com |
esin_flavo |                    wave
  rs_ilike |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
    -97777 |         1          0          0          0 |         1 
        -8 |         0          1          2          6 |         9 
        -7 |         2          0          1          0 |         3 
         1 |       341        327        338        421 |     1,427 
         2 |        75         87         99        171 |       432 
-----------+--------------------------------------------+----------
     Total |       419        415        440        598 |     1,872 

. tab use_bc_helps_ppl_quit_smoking wave

use_bc_hel |
ps_ppl_qui |                    wave
 t_smoking |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
    -97777 |         1          0          0          0 |         1 
        -8 |         1          0          2          3 |         6 
        -7 |         0          1          0          0 |         1 
         1 |       252        162        119        142 |       675 
         2 |       165         90        109        134 |       498 
-----------+--------------------------------------------+----------
     Total |       419        253        230        279 |     1,181 

. tab use_bc_dont_smell wave

use_bc_don |                    wave
   t_smell |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
    -97777 |         1          0          0          0 |         1 
        -8 |         0          2          5          7 |        14 
        -7 |         0          1          1          1 |         3 
         1 |       247        229        188        243 |       907 
         2 |       171        183        246        347 |       947 
-----------+--------------------------------------------+----------
     Total |       419        415        440        598 |     1,872 

. tab use_bc_feelslike_smoking_cig wave

use_bc_fee |
lslike_smo |                    wave
  king_cig |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
    -97777 |         1          0          0          0 |         1 
        -8 |         4          6          3         13 |        26 
        -7 |         1          2          0          3 |         6 
         1 |       129        107         71        102 |       409 
         2 |       284        300        366        480 |     1,430 
-----------+--------------------------------------------+----------
     Total |       419        415        440        598 |     1,872 

. tab use_bc_dont_bother_nontobcc_srs wave

use_bc_don |
t_bother_n |
ontobacco_ |                    wave
      usrs |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
    -97777 |         1          0          0          0 |         1 
        -8 |         3          2          6         15 |        26 
        -7 |         1          2          1          2 |         6 
         1 |       224        229        197        233 |       883 
         2 |       190        182        236        348 |       956 
-----------+--------------------------------------------+----------
     Total |       419        415        440        598 |     1,872 

. 
. log close
      name:  <unnamed>
       log:  /homes/nber/kimcwa/Documents/E-cigarettes/JUUL/PATH_ANALYSIS/ecigs.
> log
  log type:  text
 closed on:  10 Oct 2020, 21:10:51
--------------------------------------------------------------------------------
