--------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /homes/nber/kimcwa/Documents/E-cigarettes/JUUL/PATH_ANALYSIS/ecigs_
> use.log
  log type:  text
 opened on:  11 Oct 2020, 20:48:48

. 
. use "/homes/nber/kimcwa/Documents/E-cigarettes/JUUL/PATH_ANALYSIS/allwaves.dta
> ",clear
(Written by R.              )

. drop if Ever_Used == -97777 | Ever_Used == -8 | Ever_Used == -7
(104 observations deleted)

. tab Ever_Used wave, column

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |                    wave
 Ever_Used |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
       Yes |     1,451      1,403        942      1,260 |     5,056 
           |     11.94      72.32      82.85      87.56 |     30.33 
-----------+--------------------------------------------+----------
        No |    10,705        537        195        179 |    11,616 
           |     88.06      27.68      17.15      12.44 |     69.67 
-----------+--------------------------------------------+----------
     Total |    12,156      1,940      1,137      1,439 |    16,672 
           |    100.00     100.00     100.00     100.00 |    100.00 

. use "/homes/nber/kimcwa/Documents/E-cigarettes/JUUL/PATH_ANALYSIS/allwaves.dta
> ",clear
(Written by R.              )

. drop if age_first_tried == -97777 | age_first_tried == -99977 | age_first_trie
> d == -99955 | age_first_tried == -99988 | age_first_tried == -99911
(50,357 observations deleted)

. tab age_first_tried wave, column

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |                    wave
      age_first_tried |         1          2          3          4 |     Total
----------------------+--------------------------------------------+----------
Less than 12 years ol |        52         26         26         42 |       146 
                      |      3.65      55.32      50.00       7.59 |      7.03 
----------------------+--------------------------------------------+----------
   12 to 14 years old |       497         21         26        260 |       804 
                      |     34.85      44.68      50.00      47.02 |     38.69 
----------------------+--------------------------------------------+----------
   15 to 17 years old |       877          0          0        251 |     1,128 
                      |     61.50       0.00       0.00      45.39 |     54.28 
----------------------+--------------------------------------------+----------
                Total |     1,426         47         52        553 |     2,078 
                      |    100.00     100.00     100.00     100.00 |    100.00 

. use "/homes/nber/kimcwa/Documents/E-cigarettes/JUUL/PATH_ANALYSIS/allwaves.dta
> ",clear
(Written by R.              )

. drop if Past_30 == -97777 | Past_30 == -9 | Past_30 == -97777 | Past_30 == -8 
> | Past_30 == -7 | Past_30 == -5 | Past_30 == -1
(43 observations deleted)

. tab Past_30 wave, column

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Past_30d_n |
umb_days_u |                    wave
       sed |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
         0 |        20         26          0          0 |        46 
           |      4.84       6.36       0.00       0.00 |      2.52 
-----------+--------------------------------------------+----------
         1 |       121         99        135        193 |       548 
           |     29.30      24.21      31.40      33.45 |     29.96 
-----------+--------------------------------------------+----------
         2 |        83         57         60        108 |       308 
           |     20.10      13.94      13.95      18.72 |     16.84 
-----------+--------------------------------------------+----------
         3 |        35         32         26         41 |       134 
           |      8.47       7.82       6.05       7.11 |      7.33 
-----------+--------------------------------------------+----------
         4 |        11         19         14         18 |        62 
           |      2.66       4.65       3.26       3.12 |      3.39 
-----------+--------------------------------------------+----------
         5 |        36         23         35         40 |       134 
           |      8.72       5.62       8.14       6.93 |      7.33 
-----------+--------------------------------------------+----------
         6 |         7          9          9         10 |        35 
           |      1.69       2.20       2.09       1.73 |      1.91 
-----------+--------------------------------------------+----------
         7 |         9          7          5         11 |        32 
           |      2.18       1.71       1.16       1.91 |      1.75 
-----------+--------------------------------------------+----------
         8 |         5          6          8          8 |        27 
           |      1.21       1.47       1.86       1.39 |      1.48 
-----------+--------------------------------------------+----------
         9 |         3          3          4          7 |        17 
           |      0.73       0.73       0.93       1.21 |      0.93 
-----------+--------------------------------------------+----------
        10 |        10         25         19         19 |        73 
           |      2.42       6.11       4.42       3.29 |      3.99 
-----------+--------------------------------------------+----------
        11 |         1          1          2          3 |         7 
           |      0.24       0.24       0.47       0.52 |      0.38 
-----------+--------------------------------------------+----------
        12 |         7         13          7          4 |        31 
           |      1.69       3.18       1.63       0.69 |      1.69 
-----------+--------------------------------------------+----------
        13 |         1          3          1          2 |         7 
           |      0.24       0.73       0.23       0.35 |      0.38 
-----------+--------------------------------------------+----------
        14 |         1          3          2          4 |        10 
           |      0.24       0.73       0.47       0.69 |      0.55 
-----------+--------------------------------------------+----------
        15 |        14         22         27         15 |        78 
           |      3.39       5.38       6.28       2.60 |      4.26 
-----------+--------------------------------------------+----------
        16 |         0          2          2          0 |         4 
           |      0.00       0.49       0.47       0.00 |      0.22 
-----------+--------------------------------------------+----------
        17 |         0          1          0          1 |         2 
           |      0.00       0.24       0.00       0.17 |      0.11 
-----------+--------------------------------------------+----------
        18 |         1          1          3          2 |         7 
           |      0.24       0.24       0.70       0.35 |      0.38 
-----------+--------------------------------------------+----------
        19 |         0          1          0          0 |         1 
           |      0.00       0.24       0.00       0.00 |      0.05 
-----------+--------------------------------------------+----------
        20 |        15         12         25         21 |        73 
           |      3.63       2.93       5.81       3.64 |      3.99 
-----------+--------------------------------------------+----------
        21 |         1          0          0          1 |         2 
           |      0.24       0.00       0.00       0.17 |      0.11 
-----------+--------------------------------------------+----------
        22 |         2          0          2          1 |         5 
           |      0.48       0.00       0.47       0.17 |      0.27 
-----------+--------------------------------------------+----------
        23 |         0          1          0          1 |         2 
           |      0.00       0.24       0.00       0.17 |      0.11 
-----------+--------------------------------------------+----------
        24 |         0          0          1          1 |         2 
           |      0.00       0.00       0.23       0.17 |      0.11 
-----------+--------------------------------------------+----------
        25 |         6          3         11         17 |        37 
           |      1.45       0.73       2.56       2.95 |      2.02 
-----------+--------------------------------------------+----------
        26 |         0          1          0          1 |         2 
           |      0.00       0.24       0.00       0.17 |      0.11 
-----------+--------------------------------------------+----------
        27 |         2          1          0          0 |         3 
           |      0.48       0.24       0.00       0.00 |      0.16 
-----------+--------------------------------------------+----------
        28 |         1          0          3          6 |        10 
           |      0.24       0.00       0.70       1.04 |      0.55 
-----------+--------------------------------------------+----------
        29 |         1          1          0          3 |         5 
           |      0.24       0.24       0.00       0.52 |      0.27 
-----------+--------------------------------------------+----------
        30 |        20         37         29         39 |       125 
           |      4.84       9.05       6.74       6.76 |      6.83 
-----------+--------------------------------------------+----------
     Total |       413        409        430        577 |     1,829 
           |    100.00     100.00     100.00     100.00 |    100.00 

. log close
      name:  <unnamed>
       log:  /homes/nber/kimcwa/Documents/E-cigarettes/JUUL/PATH_ANALYSIS/ecigs_
> use.log
  log type:  text
 closed on:  11 Oct 2020, 20:48:48
--------------------------------------------------------------------------------
