---------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /homes/nber/kimcwa/Documents/E-cigarettes/MTF_Data/Analysis/2013_FA_Dec19.log
  log type:  text
 opened on:  20 Dec 2020, 15:45:14

. use "/homes/nber/kimcwa/Documents/E-cigarettes/MTF_Data/Process/Data/df2013_FA.dta",clear

. factor hrw_internet hrw_social_net hrw_text hrw_call hrw_video_chat
(obs=7,796)

Factor analysis/correlation                      Number of obs    =      7,796
    Method: principal factors                    Retained factors =          2
    Rotation: (unrotated)                        Number of params =          9

    --------------------------------------------------------------------------
         Factor  |   Eigenvalue   Difference        Proportion   Cumulative
    -------------+------------------------------------------------------------
        Factor1  |      2.03943      1.89751            1.1399       1.1399
        Factor2  |      0.14192      0.14579            0.0793       1.2192
        Factor3  |     -0.00387      0.17265           -0.0022       1.2170
        Factor4  |     -0.17652      0.03525           -0.0987       1.1184
        Factor5  |     -0.21178            .           -0.1184       1.0000
    --------------------------------------------------------------------------
    LR test: independent vs. saturated:  chi2(10) = 1.1e+04 Prob>chi2 = 0.0000

Factor loadings (pattern matrix) and unique variances

    -------------------------------------------------
        Variable |  Factor1   Factor2 |   Uniqueness 
    -------------+--------------------+--------------
    hrw_internet |   0.4150    0.2726 |      0.7534  
    hrw_social~t |   0.7212    0.0983 |      0.4701  
        hrw_text |   0.7257   -0.1353 |      0.4551  
        hrw_call |   0.6987   -0.1845 |      0.4777  
    hrw_video_~t |   0.5763    0.0748 |      0.6623  
    -------------------------------------------------

. predict fit1
(option regression assumed; regression scoring)

Scoring coefficients (method = regression)

    ----------------------------------
        Variable |  Factor1   Factor2 
    -------------+--------------------
    hrw_internet |  0.11621   0.26849 
    hrw_social~t |  0.29725   0.18543 
        hrw_text |  0.29654  -0.19494 
        hrw_call |  0.27298  -0.25770 
    hrw_video_~t |  0.18325   0.10492 
    ----------------------------------


. 
. count
  8,001

. tab fit1 if fit1 == .
no observations

. 
. tab sex,missing

2013 R01 R'S |
         SEX |
       F1234 |      Freq.     Percent        Cum.
-------------+-----------------------------------
MISSING:(-9) |        164        2.05        2.05
    MALE:(1) |      3,815       47.68       49.73
  FEMALE:(2) |      4,022       50.27      100.00
-------------+-----------------------------------
       Total |      8,001      100.00

. tab race ,missing

        2013 |
 RACE--B/W/H |
       F1234 |      Freq.     Percent        Cum.
-------------+-----------------------------------
MISSING:(-9) |      1,484       18.55       18.55
   BLACK:(1) |        812       10.15       28.70
   WHITE:(2) |      4,343       54.28       82.98
HISPANIC:(3) |      1,362       17.02      100.00
-------------+-----------------------------------
       Total |      8,001      100.00

. tab where_live_now,missing

    2013 R03 |
  WHERE LIVE |
 NOW   F1234 |      Freq.     Percent        Cum.
-------------+-----------------------------------
MISSING:(-9) |        117        1.46        1.46
    FARM:(1) |        301        3.76        5.22
 COUNTRY:(2) |      1,199       14.99       20.21
CITYTOWN:(3) |      6,384       79.79      100.00
-------------+-----------------------------------
       Total |      8,001      100.00

. tab grade_perf,missing

  2013 B01 R |
HS GRADE/D=1 |
       F1234 |      Freq.     Percent        Cum.
-------------+-----------------------------------
MISSING:(-9) |        136        1.70        1.70
       D:(1) |        217        2.71        4.41
      C-:(2) |        283        3.54        7.95
       C:(3) |        470        5.87       13.82
      C+:(4) |        718        8.97       22.80
      B-:(5) |        801       10.01       32.81
       B:(6) |      1,195       14.94       47.74
      B+:(7) |      1,299       16.24       63.98
      A-:(8) |      1,390       17.37       81.35
       A:(9) |      1,492       18.65      100.00
-------------+-----------------------------------
       Total |      8,001      100.00

. tab large_msa,missing

   2013 LARGE MSA=1/NOT=0 |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
NOT SELF REPRESENTING:(0) |      5,415       67.68       67.68
 SELF REPRESENT METRO:(1) |      2,586       32.32      100.00
--------------------------+-----------------------------------
                    Total |      8,001      100.00

. tab msa,missing

        2013 MSA=1/NON-MSA=0 |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                NON SMSA:(0) |      1,644       20.55       20.55
STANDARD METRO STAT AREA:(1) |      6,357       79.45      100.00
-----------------------------+-----------------------------------
                       Total |      8,001      100.00

. tab school_region,missing

     2013 SCHOOL |
          REGION |      Freq.     Percent        Cum.
-----------------+-----------------------------------
   NORTHEAST:(1) |      1,358       16.97       16.97
NORTHCENTRAL:(2) |      1,885       23.56       40.53
       SOUTH:(3) |      2,790       34.87       75.40
        WEST:(4) |      1,968       24.60      100.00
-----------------+-----------------------------------
           Total |      8,001      100.00

. tab feduc,missing

     2013 R02 |
   FATHR EDUC |
  LEVEL F1234 |      Freq.     Percent        Cum.
--------------+-----------------------------------
 MISSING:(-9) |         88        1.10        1.10
GRADE SCH:(1) |        274        3.42        4.52
  SOME HS:(2) |        729        9.11       13.64
  HS GRAD:(3) |      1,786       22.32       35.96
 SOME CLG:(4) |        912       11.40       47.36
 CLG GRAD:(5) |      1,886       23.57       70.93
 GRAD SCH:(6) |      1,200       15.00       85.93
       DK:(7) |      1,126       14.07      100.00
--------------+-----------------------------------
        Total |      8,001      100.00

. tab meduc,missing

     2013 R02 |
   MOTHR EDUC |
  LEVEL F1234 |      Freq.     Percent        Cum.
--------------+-----------------------------------
 MISSING:(-9) |         77        0.96        0.96
GRADE SCH:(1) |        226        2.82        3.79
  SOME HS:(2) |        588        7.35       11.14
  HS GRAD:(3) |      1,540       19.25       30.38
 SOME CLG:(4) |      1,189       14.86       45.24
 CLG GRAD:(5) |      2,343       29.28       74.53
 GRAD SCH:(6) |      1,337       16.71       91.24
       DK:(7) |        701        8.76      100.00
--------------+-----------------------------------
        Total |      8,001      100.00

. 
. drop sex race where_live_now grade_perf large_msa msa school_region feduc meduc 

. 
. regress fit1 sex* race* grade_perf* large_msa* msa* school_region* meduc* feduc* where_live_now*
note: large_msa_1 omitted because of collinearity
note: msa_1 omitted because of collinearity
note: school_region_4 omitted because of collinearity

      Source |       SS           df       MS      Number of obs   =     7,796
-------------+----------------------------------   F(36, 7759)     =     18.31
       Model |  472.554384        36  13.1265107   Prob > F        =    0.0000
    Residual |  5562.05878     7,759   .71685253   R-squared       =    0.0783
-------------+----------------------------------   Adj R-squared   =    0.0740
       Total |  6034.61316     7,795  .774164614   Root MSE        =    .84667

----------------------------------------------------------------------------------
            fit1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           sex_1 |  -.1414154   .0858361    -1.65   0.099    -.3096773    .0268465
           sex_2 |   .1900308   .0858543     2.21   0.027     .0217332    .3583284
          race_1 |   .0309401   .0392915     0.79   0.431    -.0460818     .107962
          race_2 |  -.1126184   .0268744    -4.19   0.000    -.1652996   -.0599373
          race_3 |  -.0859414   .0344517    -2.49   0.013     -.153476   -.0184068
    grade_perf_1 |   .1215193   .1000348     1.21   0.224    -.0745759    .3176146
    grade_perf_2 |   .0339531     .09589     0.35   0.723    -.1540171    .2219233
    grade_perf_3 |  -.0676894   .0900585    -0.75   0.452    -.2442284    .1088495
    grade_perf_4 |  -.0259172   .0868885    -0.30   0.765    -.1962421    .1444076
    grade_perf_5 |  -.0927543   .0862588    -1.08   0.282    -.2618449    .0763363
    grade_perf_6 |  -.2316035   .0844503    -2.74   0.006    -.3971489   -.0660582
    grade_perf_7 |  -.1966605   .0842395    -2.33   0.020    -.3617926   -.0315284
    grade_perf_8 |  -.3392005   .0841482    -4.03   0.000    -.5041537   -.1742472
    grade_perf_9 |  -.4786271   .0840782    -5.69   0.000    -.6434432   -.3138111
     large_msa_0 |  -.0134379   .0226509    -0.59   0.553    -.0578398     .030964
     large_msa_1 |          0  (omitted)
           msa_0 |  -.0278444   .0273465    -1.02   0.309     -.081451    .0257622
           msa_1 |          0  (omitted)
 school_region_1 |   .0809856   .0314797     2.57   0.010     .0192769    .1426943
 school_region_2 |   .0900967   .0289256     3.11   0.002     .0333947    .1467988
 school_region_3 |   .1181308   .0268816     4.39   0.000     .0654357    .1708258
 school_region_4 |          0  (omitted)
         meduc_1 |  -.2515002   .2069003    -1.22   0.224    -.6570807    .1540803
         meduc_2 |   -.033682   .2005412    -0.17   0.867    -.4267968    .3594328
         meduc_3 |  -.0950917   .1986064    -0.48   0.632    -.4844137    .2942304
         meduc_4 |  -.0595913   .1989053    -0.30   0.764    -.4494993    .3303167
         meduc_5 |  -.0633865   .1978833    -0.32   0.749    -.4512912    .3245182
         meduc_6 |   .0121441   .1988312     0.06   0.951    -.3776187    .4019069
         meduc_7 |  -.1656401   .2010846    -0.82   0.410    -.5598201    .2285399
         feduc_1 |   .3930188    .187487     2.10   0.036     .0254936    .7605439
         feduc_2 |   .5077531   .1817099     2.79   0.005     .1515526    .8639536
         feduc_3 |   .4870388   .1798211     2.71   0.007     .1345409    .8395366
         feduc_4 |   .5164921   .1810907     2.85   0.004     .1615054    .8714787
         feduc_5 |   .4295457   .1797265     2.39   0.017     .0772333    .7818581
         feduc_6 |   .3822617   .1811004     2.11   0.035      .027256    .7372673
         feduc_7 |   .4434218   .1812373     2.45   0.014     .0881479    .7986957
where_live_now_1 |   -.207622   .1159478    -1.79   0.073    -.4349109     .019667
where_live_now_2 |  -.1586403   .1068425    -1.48   0.138    -.3680804    .0507999
where_live_now_3 |  -.1642605   .1045914    -1.57   0.116    -.3692878    .0407668
           _cons |  -.0081528   .1203631    -0.07   0.946     -.244097    .2277914
----------------------------------------------------------------------------------

. 
. * reg large_msa1 sex* race* grade_perf*  meduc* feduc* where_live_now*
. * reg msa_1 sex* race* grade_perf*  meduc* feduc* where_live_now*
. 
. log close
      name:  <unnamed>
       log:  /homes/nber/kimcwa/Documents/E-cigarettes/MTF_Data/Analysis/2013_FA_Dec19.log
  log type:  text
 closed on:  20 Dec 2020, 15:45:14
---------------------------------------------------------------------------------------------------
